app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `pets`
SELECT COUNT(*) AS `numrows`
FROM `pets`
WHERE `status` = 'registered'
SELECT COUNT(*) AS `numrows`
FROM `pets`
WHERE `status` = 'lost'
SELECT COUNT(*) AS `numrows`
FROM `pets`
WHERE `status` = 'for_adoption'
---
    public function dashboard()
    {
        $petModel = new PetModel();

        $data = [
            'title'       => 'Admin Dashboard',
            'totalPets'   => $petModel->countAll(),
            'registered'  => $petModel->where('status', 'registered')->countAllResults(),
            'lost'        => $petModel->where('status', 'lost')->countAllResults(),
            'forAdoption' => $petModel->where('status', 'for_adoption')->countAllResults(),