app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1
---
    public function login()
    {
        helper(['form', 'url']);

        // If already logged in, redirect based on role
        if (session()->has('user_id') && uri_string() !== 'auth/login') {
            return $this->redirectBasedOnRole();
        }

        if ($this->request->getMethod() === 'POST') {
            // Only validate that fields are filled — no password length check here
            $rules = [
                'username' => 'required',
                'password' => 'required',
            ];

            if (!$this->validate($rules)) {
                return view('auth/pages/login', ['validation' => $this->validator]);
            }

            $loginInput = $this->request->getPost('username');
            $password   = $this->request->getPost('password');

            $userModel = new UserModel();

            // Try to find user by username OR email
            $user = $userModel->where('username', $loginInput)
                              ->orWhere('email', $loginInput)
                              ->first();

INSERT INTO `residents` (`first_name`, `middle_name`, `last_name`, `barangay`, `contact_number`, `email`, `created_at`) VALUES ('juan', 'a', 'dela cruz', 'alipit', '09987654321', 'juandelacruz@gmail.com', '2025-12-20 07:50:45')
---
    public function register()
    {
        helper(['form']);

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'first_name'       => 'required|min_length[2]',
                'last_name'        => 'required|min_length[2]',
                'username'         => 'required|min_length[3]|max_length[50]|is_unique[users.username]',
                'email'            => 'required|valid_email|is_unique[users.email]',
                'password'         => 'required|min_length[6]',
                'confirm_password' => 'required|matches[password]',
                'barangay'         => 'required',
                'contact_number'   => 'required|min_length[10]|max_length[11]',
            ];

            if (!$this->validate($rules)) {
                return view('auth/pages/register', ['validation' => $this->validator]);
            }

            $residentModel = new ResidentModel();
            $userModel     = new UserModel();

            $residentId = $residentModel->insert([
                'first_name'     => $this->request->getPost('first_name'),
                'middle_name'    => $this->request->getPost('middle_name'),
                'last_name'      => $this->request->getPost('last_name'),
                'barangay'       => $this->request->getPost('barangay'),
                'contact_number' => $this->request->getPost('contact_number'),
                'email'          => $this->request->getPost('email'),
                'created_at'     => date('Y-m-d H:i:s')
            ]);

INSERT INTO `users` (`username`, `email`, `password`, `role`, `resident_id`, `created_at`) VALUES ('juandelacruz', 'juandelacruz@gmail.com', '$2y$10$aR4u0iwHADupIqUlk3W1B.rmRfgdY2/hIr00yeF0tq7n3rU0vSRVa', 'user', 34, '2025-12-20 07:50:45')
---
                return view('auth/pages/register', ['error' => 'Failed to create resident record.']);
            }

            $userInserted = $userModel->insert([
                'username'    => $this->request->getPost('username'),
                'email'       => $this->request->getPost('email'),
                'password'    => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                'role'        => 'user',
                'resident_id' => $residentId,
                'created_at'  => date('Y-m-d H:i:s')
            ]);