app/Controllers/DashboardController.php

    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login');
        }

        $petModel = new PetModel();
        $pets = $petModel->findAll();
---
SELECT *
FROM `pets`