app/Controllers/PetsController.php

    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login');
        }

        $pets = $this->petModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `pets`
ORDER BY `created_at` DESC

            'created_at'     => date('Y-m-d H:i:s'),
        ];

        $this->petModel->insert($data);
---
INSERT INTO `pets` (`user_id`, `pet_name`, `species`, `breed`, `status`, `description`, `image`, `location`, `contact_number`, `created_at`) VALUES ('7', 'bantay', 'dog', 'aspin', 'registered', 'makulit, malikot, maamo, mabait, matapang', 'https://i.pinimg.com/1200x/f5/0f/f9/f50ff9145f731302d26978108cb78b23.jpg', 'alipit, Pila', '09987654321', '2025-12-20 07:53:37')

    public function editPet($id)
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login');
        }

        $pet = $this->petModel->find($id);
---
SELECT *
FROM `pets`
WHERE `pets`.`id` = '11'

    public function deletePet($id)
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login');
        }

        $pet = $this->petModel->find($id);
        if (!$pet || $pet['user_id'] != session('user_id')) {
            return redirect()->to('/resident/my-pets')->with('error', 'Access denied.');
        }

        $this->petModel->delete($id);
---
SELECT *
FROM `pets`
WHERE `pets`.`id` = '11'
DELETE FROM `pets`
WHERE `id` IN ('11')