app/Controllers/ResidentsController.php

SELECT *
FROM `residents`
ORDER BY `full_name` ASC
 LIMIT 15, 15
---
    public function index()
    {
        if (!session()->has('user_id') || session('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Admins only');
        }

        $model = new ResidentModel();

        $residents = $model->orderBy('full_name', 'ASC')->paginate($this->perPage);