app/Controllers/ResidentsController.php

SELECT *
FROM `residents`
ORDER BY `last_name` ASC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `residents`
SELECT `barangay`
FROM `residents`
GROUP BY `barangay`
SELECT COUNT(*) AS `numrows` FROM `residents`
---
    public function index()
    {
        if (session('role') !== 'admin') {
            return redirect()->to('/resident/dashboard')->with('error', 'Admins only');
        }

        $model = new ResidentModel();
        $residents = $model->orderBy('last_name', 'ASC')->paginate($this->perPage);

        $barangayModel = new ResidentModel();
        $uniqueBarangays = $barangayModel->select('barangay')->groupBy('barangay')->findAll();

        $data = [
            'title'           => 'Manage Residents (Admin)',
            'residents'       => $residents,
            'totalResidents'  => $model->countAll(),
            'barangayCount'   => count($uniqueBarangays),
            'pager'           => $model->pager
        ];

SELECT *
FROM `pets`
WHERE `user_id` = '2'
---
    public function profile()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login');
        }

        // Fetch user's pets to display on profile
        $petModel = new PetModel();
        $pets = $petModel->where('user_id', session('user_id'))->findAll();

SELECT *
FROM `pets`
WHERE `user_id` = '7'
---
    public function myPets()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login');
        }

        $petModel = new PetModel();
        $pets = $petModel->where('user_id', session('user_id'))->findAll();