app/Models/PetModel.php

    public function getPetsWithOwner()
    {
        return $this->select('pets.*, users.username as owner_name, users.email as owner_email')
                    ->join('users', 'users.id = pets.user_id')
                    ->findAll();
---
SELECT `pets`.*, COALESCE(
                    CONCAT(
                        residents.first_name, " ", IFNULL(CONCAT(residents.middle_name, " "), ""), residents.last_name
                    ), users.username
                ) as owner_name
FROM `pets`
LEFT JOIN `users` ON `users`.`id` = `pets`.`user_id`
LEFT JOIN `residents` ON `residents`.`id` = `users`.`resident_id`